
//---------------- Вариант подключения с условной компиляцией -----------------
#ifndef MP_BAR_H
#define MP_BAR_H

#include "mp_foo.h"
class MP_Bar
{
public:
    MP_Bar();
};

#endif // MP_BAR_H
//-------------------------------------------------------------------------------

//---------------- Вариант подключения с директивой Pragma Once -----------------
// #pragma once
// #include "mp_foo.h"
// class MP_Bar
// {
// public:
//     MP_Bar();
// };
//-------------------------------------------------------------------------------
