//---------------- Вариант подключения с условной компиляцией -----------------
#ifndef MP_FOO_H
#define MP_FOO_H
#include "mp_bar.h"
class MP_Foo
{
public:
    MP_Foo();
};

#endif // MP_FOO_H
//-------------------------------------------------------------------------------

//---------------- Вариант подключения с директивой Pragma Once -----------------
// #pragma once
// #include "mp_bar.h"
// class MP_Foo
// {
// public:
//     MP_Foo();
// };
//-------------------------------------------------------------------------------
